benchmark/jmeter/results/report-camel-20260707_125002/statistics.json
{
  "POST Login (camel)" : {
    "transaction" : "POST Login (camel)",
    "sampleCount" : 10,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 133.0,
    "medianResTime" : 133.0,
    "minResTime" : 123.0,
    "maxResTime" : 149.0,
    "pct1ResTime" : 148.0,
    "pct2ResTime" : 149.0,
    "pct3ResTime" : 149.0,
    "throughput" : 2.158428663932657,
    "receivedKBytesPerSec" : 1.8464682710986402,
    "sentKBytesPerSec" : 0.5058817181092164
  },
  "POST Login (saga)" : {
    "transaction" : "POST Login (saga)",
    "sampleCount" : 10,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 154.79999999999998,
    "medianResTime" : 146.5,
    "minResTime" : 128.0,
    "maxResTime" : 242.0,
    "pct1ResTime" : 234.10000000000002,
    "pct2ResTime" : 242.0,
    "pct3ResTime" : 242.0,
    "throughput" : 2.2016732716864817,
    "receivedKBytesPerSec" : 1.883462681638045,
    "sentKBytesPerSec" : 0.5160171730515192
  },
  "GET camel status" : {
    "transaction" : "GET camel status",
    "sampleCount" : 200,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 40.005,
    "medianResTime" : 37.5,
    "minResTime" : 16.0,
    "maxResTime" : 119.0,
    "pct1ResTime" : 57.0,
    "pct2ResTime" : 71.94999999999999,
    "pct3ResTime" : 115.0,
    "throughput" : 1.2504845627680727,
    "receivedKBytesPerSec" : 0.3734845690204955,
    "sentKBytesPerSec" : 0.5580775831884855
  },
  "Total" : {
    "transaction" : "Total",
    "sampleCount" : 420,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 41.607142857142826,
    "medianResTime" : 34.0,
    "minResTime" : 14.0,
    "maxResTime" : 253.0,
    "pct1ResTime" : 58.900000000000034,
    "pct2ResTime" : 123.94999999999999,
    "pct3ResTime" : 161.74000000000012,
    "throughput" : 2.4190622102165062,
    "receivedKBytesPerSec" : 0.8813198000241905,
    "sentKBytesPerSec" : 1.1586840013592825
  },
  "POST place-order CAMEL" : {
    "transaction" : "POST place-order CAMEL",
    "sampleCount" : 200,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 32.97999999999999,
    "medianResTime" : 30.0,
    "minResTime" : 14.0,
    "maxResTime" : 253.0,
    "pct1ResTime" : 46.0,
    "pct2ResTime" : 51.0,
    "pct3ResTime" : 169.1100000000008,
    "throughput" : 1.2504220174308829,
    "receivedKBytesPerSec" : 0.4762349480449652,
    "sentKBytesPerSec" : 0.6703922730171433
  }
}