benchmark/jmeter/results/report-saga-20260707_125334/statistics.json
{
  "POST Login (camel)" : {
    "transaction" : "POST Login (camel)",
    "sampleCount" : 10,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 141.4,
    "medianResTime" : 138.5,
    "minResTime" : 137.0,
    "maxResTime" : 154.0,
    "pct1ResTime" : 153.2,
    "pct2ResTime" : 154.0,
    "pct3ResTime" : 154.0,
    "throughput" : 2.1556369907307613,
    "receivedKBytesPerSec" : 1.8440800819142056,
    "sentKBytesPerSec" : 0.505227419702522
  },
  "POST Login (saga)" : {
    "transaction" : "POST Login (saga)",
    "sampleCount" : 10,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 147.5,
    "medianResTime" : 138.5,
    "minResTime" : 129.0,
    "maxResTime" : 220.0,
    "pct1ResTime" : 214.00000000000003,
    "pct2ResTime" : 220.0,
    "pct3ResTime" : 220.0,
    "throughput" : 2.2123893805309733,
    "receivedKBytesPerSec" : 1.8926299778761064,
    "sentKBytesPerSec" : 0.5185287610619469
  },
  "POST place-order SAGA" : {
    "transaction" : "POST place-order SAGA",
    "sampleCount" : 200,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 18.304999999999986,
    "medianResTime" : 17.0,
    "minResTime" : 8.0,
    "maxResTime" : 50.0,
    "pct1ResTime" : 26.0,
    "pct2ResTime" : 31.94999999999999,
    "pct3ResTime" : 45.960000000000036,
    "throughput" : 1.244694489737494,
    "receivedKBytesPerSec" : 0.29901840280803077,
    "sentKBytesPerSec" : 0.6661060355235808
  },
  "GET saga status" : {
    "transaction" : "GET saga status",
    "sampleCount" : 200,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 22.39000000000001,
    "medianResTime" : 21.0,
    "minResTime" : 11.0,
    "maxResTime" : 45.0,
    "pct1ResTime" : 30.0,
    "pct2ResTime" : 33.89999999999998,
    "pct3ResTime" : 39.99000000000001,
    "throughput" : 1.244880429234772,
    "receivedKBytesPerSec" : 0.35620113844315254,
    "sentKBytesPerSec" : 0.555576519687784
  },
  "Total" : {
    "transaction" : "Total",
    "sampleCount" : 420,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 26.25714285714286,
    "medianResTime" : 20.0,
    "minResTime" : 8.0,
    "maxResTime" : 220.0,
    "pct1ResTime" : 31.0,
    "pct2ResTime" : 49.799999999999955,
    "pct3ResTime" : 148.58000000000004,
    "throughput" : 2.4139318351629404,
    "receivedKBytesPerSec" : 0.7033899218345881,
    "sentKBytesPerSec" : 1.1551041008103913
  }
}