benchmark/jmeter/results/report-spring-integration-20260807_121627/statistics.json
{
  "POST Login (camel)" : {
    "transaction" : "POST Login (camel)",
    "sampleCount" : 10,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 82.6,
    "medianResTime" : 83.5,
    "minResTime" : 73.0,
    "maxResTime" : 89.0,
    "pct1ResTime" : 88.9,
    "pct2ResTime" : 89.0,
    "pct3ResTime" : 89.0,
    "throughput" : 2.1805494984736153,
    "receivedKBytesPerSec" : 1.8653919537723505,
    "sentKBytesPerSec" : 0.5110662887047536
  },
  "POST Login (spring-integration)" : {
    "transaction" : "POST Login (spring-integration)",
    "sampleCount" : 10,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 111.89999999999999,
    "medianResTime" : 107.5,
    "minResTime" : 77.0,
    "maxResTime" : 169.0,
    "pct1ResTime" : 168.3,
    "pct2ResTime" : 169.0,
    "pct3ResTime" : 169.0,
    "throughput" : 2.142704092564817,
    "receivedKBytesPerSec" : 1.8330163916863083,
    "sentKBytesPerSec" : 0.5021962716948789
  },
  "POST Login (saga)" : {
    "transaction" : "POST Login (saga)",
    "sampleCount" : 10,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 167.9,
    "medianResTime" : 95.0,
    "minResTime" : 74.0,
    "maxResTime" : 686.0,
    "pct1ResTime" : 645.3000000000002,
    "pct2ResTime" : 686.0,
    "pct3ResTime" : 686.0,
    "throughput" : 2.222716159146477,
    "receivedKBytesPerSec" : 1.901464214269838,
    "sentKBytesPerSec" : 0.5209490997999556
  },
  "POST place-order SPRING-INTEGRATION" : {
    "transaction" : "POST place-order SPRING-INTEGRATION",
    "sampleCount" : 200,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 27.924999999999983,
    "medianResTime" : 19.0,
    "minResTime" : 8.0,
    "maxResTime" : 560.0,
    "pct1ResTime" : 33.80000000000001,
    "pct2ResTime" : 42.0,
    "pct3ResTime" : 448.20000000000164,
    "throughput" : 1.2356128330748843,
    "receivedKBytesPerSec" : 0.29683667669572417,
    "sentKBytesPerSec" : 0.6781390744024267
  },
  "GET spring-integration status" : {
    "transaction" : "GET spring-integration status",
    "sampleCount" : 200,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 25.450000000000006,
    "medianResTime" : 23.0,
    "minResTime" : 10.0,
    "maxResTime" : 193.0,
    "pct1ResTime" : 39.70000000000002,
    "pct2ResTime" : 45.94999999999999,
    "pct3ResTime" : 73.92000000000007,
    "throughput" : 1.2283654141433995,
    "receivedKBytesPerSec" : 0.3514756507265781,
    "sentKBytesPerSec" : 0.5482060490854819
  },
  "Total" : {
    "transaction" : "Total",
    "sampleCount" : 430,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 33.253488372093,
    "medianResTime" : 22.0,
    "minResTime" : 8.0,
    "maxResTime" : 686.0,
    "pct1ResTime" : 51.0,
    "pct2ResTime" : 90.34999999999997,
    "pct3ResTime" : 276.21,
    "throughput" : 2.381321578096272,
    "receivedKBytesPerSec" : 0.7251262654232107,
    "sentKBytesPerSec" : 1.141122031654963
  }
}